In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Abhinav", "Rahul", "Shivansh", "Display"],
    "marks" : [93, 4, 66, 33],
    "city" : ["Mumbai", "kalyan", "Madhubani", "Kolkata"]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [5]:
df.to_csv("friends.csv")

In [6]:
df.to_csv("friends_indexFalse.csv", index=False)

In [7]:
df.head(2)

      name  marks    city
0  Abhinav     93  Mumbai
1    Rahul      4  kalyan

In [8]:
df.tail(2)

       name  marks       city
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [9]:
df.tail(10)

       name  marks       city
0   Abhinav     93     Mumbai
1     Rahul      4     kalyan
2  Shivansh     66  Madhubani
3   Display     33    Kolkata

In [10]:
df.describe()

           marks
count   4.000000
mean   49.000000
std    38.755645
min     4.000000
25%    25.750000
50%    49.500000
75%    72.750000
max    93.000000

In [11]:
train = pd.read_csv("train.csv")

In [12]:
train["Speed"]

0    129
1    123
2    200
3     90
Name: Speed, dtype: int64

In [13]:
train["city"][0]

'Mumbai'

In [14]:
train['city'][3] = "Patna"

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_2588/3634185913.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['city'][3] = "Patna"

In [15]:
train.to_csv("train.csv", index=False)

In [16]:
train

   Tain no.  Speed    city
0    893009    129  Mumbai
1    239843    123   Delhi
2    234323    200    Kota
3    324234     90   Patna

In [17]:
train.index = ["First", "Second", "Third", "Fourth"]

In [18]:
train

        Tain no.  Speed    city
First     893009    129  Mumbai
Second    239843    123   Delhi
Third     234323    200    Kota
Fourth    324234     90   Patna

In [19]:
series = pd.Series(np.random.rand(20))

In [20]:
print(series, type(series))

0     0.892308
1     0.019686
2     0.352222
3     0.680118
4     0.000105
5     0.523514
6     0.238157
7     0.755110
8     0.054363
9     0.329335
10    0.638200
11    0.372056
12    0.382897
13    0.484260
14    0.071149
15    0.614620
16    0.338400
17    0.352876
18    0.596942
19    0.891539
dtype: float64 <class 'pandas.core.series.Series'>

In [21]:
new_df = pd.DataFrame(np.random.rand(445, 6), index=np.arange(445))

In [22]:
new_df.head()

          0         1         2         3         4         5
0  0.026610  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2  0.728610  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [23]:
new_df.tail()

            0         1         2         3         4         5
440  0.366501  0.338691  0.065218  0.622642  0.255830  0.430014
441  0.612678  0.704572  0.355077  0.002490  0.082120  0.979282
442  0.534451  0.404527  0.873619  0.575251  0.915457  0.343716
443  0.209470  0.406620  0.171258  0.115146  0.074322  0.946204
444  0.319014  0.319168  0.302161  0.534227  0.648596  0.333659

In [24]:
new_df.describe()

                0           1           2           3           4           5
count  445.000000  445.000000  445.000000  445.000000  445.000000  445.000000
mean     0.516150    0.510808    0.487933    0.493223    0.501742    0.514778
std      0.289899    0.289509    0.299314    0.288052    0.303023    0.286151
min      0.000958    0.002625    0.001943    0.000172    0.000170    0.003700
25%      0.283968    0.268569    0.223445    0.236386    0.233813    0.272133
50%      0.533974    0.517471    0.483275    0.493839    0.512254    0.516661
75%      0.749628    0.763479    0.745628    0.750959    0.770636    0.768644
max      0.997996    0.997384    0.999605    0.986454    0.998772    0.999719

In [25]:
print(type(new_df))

<class 'pandas.core.frame.DataFrame'>

In [26]:
new_df[0][0] = "Abhinav"

In [27]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
5    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4         5
0   Abhinav  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2   0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [29]:
new_df[0][0] = 0.5

In [30]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2   0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [31]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,435,436,437,438,439,440,441,442,443,444
0,0.5,0.060224,0.72861,0.917867,0.674388,0.784892,0.886783,0.860829,0.377174,0.530079,...,0.343045,0.569653,0.201789,0.807617,0.985746,0.366501,0.612678,0.534451,0.20947,0.319014
1,0.389168,0.98743,0.238399,0.467754,0.011974,0.760276,0.76625,0.302666,0.50803,0.921069,...,0.758312,0.691493,0.508827,0.081209,0.10298,0.338691,0.704572,0.404527,0.40662,0.319168
2,0.052477,0.005725,0.018725,0.046411,0.557985,0.525272,0.807104,0.813198,0.557904,0.195634,...,0.246998,0.040934,0.292267,0.13969,0.671839,0.065218,0.355077,0.873619,0.171258,0.302161
3,0.423259,0.153605,0.408156,0.870903,0.55118,0.418736,0.283976,0.831537,0.856847,0.977804,...,0.235377,0.513995,0.613691,0.825553,0.336475,0.622642,0.00249,0.575251,0.115146,0.534227
4,0.407235,0.256132,0.815878,0.554316,0.759762,0.83523,0.080189,0.191315,0.194405,0.616893,...,0.775289,0.662748,0.065268,0.094354,0.362165,0.25583,0.08212,0.915457,0.074322,0.648596
5,0.100711,0.982076,0.495681,0.693104,0.372287,0.500335,0.214146,0.780947,0.982693,0.059592,...,0.293965,0.801386,0.173414,0.804478,0.181537,0.430014,0.979282,0.343716,0.946204,0.333659

In [32]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2   0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [33]:
new_df.sort_index(axis=0, ascending=False)

            0         1         2         3         4         5
444  0.319014  0.319168  0.302161  0.534227  0.648596  0.333659
443   0.20947  0.406620  0.171258  0.115146  0.074322  0.946204
442  0.534451  0.404527  0.873619  0.575251  0.915457  0.343716
441  0.612678  0.704572  0.355077  0.002490  0.082120  0.979282
440  0.366501  0.338691  0.065218  0.622642  0.255830  0.430014
..        ...       ...       ...       ...       ...       ...
4    0.674388  0.011974  0.557985  0.551180  0.759762  0.372287
3    0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
2     0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
1    0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
0         0.5  0.389168  0.052477  0.423259  0.407235  0.100711

[445 rows x 6 columns]

In [34]:
new_df.sort_index(axis=1, ascending=True)

            0         1         2         3         4         5
0         0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1    0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2     0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3    0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4    0.674388  0.011974  0.557985  0.551180  0.759762  0.372287
..        ...       ...       ...       ...       ...       ...
440  0.366501  0.338691  0.065218  0.622642  0.255830  0.430014
441  0.612678  0.704572  0.355077  0.002490  0.082120  0.979282
442  0.534451  0.404527  0.873619  0.575251  0.915457  0.343716
443   0.20947  0.406620  0.171258  0.115146  0.074322  0.946204
444  0.319014  0.319168  0.302161  0.534227  0.648596  0.333659

[445 rows x 6 columns]

In [35]:
type(new_df[0])

pandas.core.series.Series

In [36]:
new_df2 = new_df.copy()

In [37]:
new_df2[0][0] = 983
new_df2.head()

C:\Users\ADMIN\AppData\Local\Temp/ipykernel_2588/250112503.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df2[0][0] = 983

          0         1         2         3         4         5
0       983  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2   0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [38]:
new_df.head()

          0         1         2         3         4         5
0       0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2   0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3  0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4  0.674388  0.011974  0.557985  0.551180  0.759762  0.372287

In [39]:
#new_df.loc[0, "A"] = 556  #no warning

In [40]:
new_df.head(2)

          0         1         2         3         4         5
0       0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1  0.060224  0.987430  0.005725  0.153605  0.256132  0.982076

In [41]:
new_df.columns = list("ABCDEF")

In [42]:
new_df

            A         B         C         D         E         F
0         0.5  0.389168  0.052477  0.423259  0.407235  0.100711
1    0.060224  0.987430  0.005725  0.153605  0.256132  0.982076
2     0.72861  0.238399  0.018725  0.408156  0.815878  0.495681
3    0.917867  0.467754  0.046411  0.870903  0.554316  0.693104
4    0.674388  0.011974  0.557985  0.551180  0.759762  0.372287
..        ...       ...       ...       ...       ...       ...
440  0.366501  0.338691  0.065218  0.622642  0.255830  0.430014
441  0.612678  0.704572  0.355077  0.002490  0.082120  0.979282
442  0.534451  0.404527  0.873619  0.575251  0.915457  0.343716
443   0.20947  0.406620  0.171258  0.115146  0.074322  0.946204
444  0.319014  0.319168  0.302161  0.534227  0.648596  0.333659

[445 rows x 6 columns]

In [43]:
new_df = new_df.drop("F", axis=1)

In [44]:
new_df.head()

          A         B         C         D         E
0       0.5  0.389168  0.052477  0.423259  0.407235
1  0.060224  0.987430  0.005725  0.153605  0.256132
2   0.72861  0.238399  0.018725  0.408156  0.815878
3  0.917867  0.467754  0.046411  0.870903  0.554316
4  0.674388  0.011974  0.557985  0.551180  0.759762

In [45]:
new_df.loc[[1, 2], ["C", "D"]]
new_df.loc[[1, 2], :]
new_df.loc[:, ["C", "D"]]

            C         D
0    0.052477  0.423259
1    0.005725  0.153605
2    0.018725  0.408156
3    0.046411  0.870903
4    0.557985  0.551180
..        ...       ...
440  0.065218  0.622642
441  0.355077  0.002490
442  0.873619  0.575251
443  0.171258  0.115146
444  0.302161  0.534227

[445 rows x 2 columns]

# Try to Run Complex quearies in data frames

In [46]:
new_df.loc[new_df["A"] < 0.2]
new_df.loc[(new_df["B"] < 0.3) & (new_df["C"] > 0.1)]

            A         B         C         D         E
4    0.674388  0.011974  0.557985  0.551180  0.759762
10   0.829179  0.211144  0.371134  0.136553  0.272977
17   0.925586  0.051327  0.535076  0.874254  0.283409
18   0.512641  0.158534  0.718549  0.601395  0.048219
21   0.152236  0.011013  0.784818  0.930742  0.720872
..        ...       ...       ...       ...       ...
426  0.896218  0.086936  0.240439  0.680047  0.829503
427  0.578108  0.222270  0.603350  0.315899  0.892764
434  0.265823  0.033898  0.561601  0.238356  0.387588
438  0.807617  0.081209  0.139690  0.825553  0.094354
439  0.985746  0.102980  0.671839  0.336475  0.362165

[110 rows x 5 columns]

In [47]:
new_df.loc[new_df["E"] > 0.9]

            A         B         C         D         E
20   0.700476  0.318166  0.446265  0.452350  0.975092
30   0.719321  0.095917  0.765699  0.952136  0.993519
46   0.338524  0.801239  0.332531  0.794931  0.944393
52   0.973236  0.688268  0.334913  0.308388  0.927064
60   0.641077  0.251376  0.045865  0.182716  0.998772
63    0.02972  0.097347  0.232487  0.092735  0.941263
66   0.381967  0.695714  0.660821  0.556530  0.945002
77   0.752311  0.326332  0.229070  0.454116  0.909116
85   0.045136  0.783774  0.500343  0.198155  0.928612
98   0.136255  0.952874  0.170436  0.869608  0.997110
124  0.778473  0.769224  0.796284  0.777322  0.901575
125  0.573409  0.539210  0.177848  0.780600  0.970819
132  0.379748  0.928989  0.586604  0.940622  0.957858
144  0.332267  0.435888  0.126135  0.792925  0.982656
152  0.595199  0.996046  0.696542  0.705715  0.925800
169  0.031856  0.125573  0.814471  0.160859  0.976219
190   0.39996  0.294897  0.991578  0.089290  0.919852
212  0.445972  0.889284  0.464486  0.270531  0.911663
227  0.761183  0.101656  0.605930  0.264073  0.913688
229  0.666886  0.706007  0.001943  0.820895  0.978834
238  0.412511  0.362411  0.004033  0.877421  0.975304
243  0.328395  0.994986  0.146843  0.319609  0.915690
245  0.615875  0.334837  0.030947  0.505988  0.926485
269  0.200552  0.374518  0.926516  0.879099  0.975997
277  0.243434  0.347868  0.924540  0.034973  0.990241
291  0.089267  0.769810  0.879768  0.501717  0.964679
297  0.985606  0.950106  0.194068  0.072416  0.981153
298  0.908409  0.395740  0.756376  0.730983  0.944478
303  0.992139  0.419375  0.700087  0.000172  0.903676
306    0.6044  0.773290  0.800828  0.264272  0.986223
308  0.757269  0.897009  0.024048  0.012694  0.960359
309  0.823734  0.463497  0.045331  0.318223  0.916944
310  0.395431  0.724215  0.194272  0.009444  0.987283
313  0.368885  0.708411  0.287320  0.239626  0.938509
320  0.708657  0.311369  0.805893  0.496181  0.938170
329  0.482197  0.746142  0.481933  0.465387  0.991323
331  0.883599  0.777636  0.099620  0.642923  0.950836
352  0.656008  0.348018  0.877563  0.486375  0.906707
355  0.009543  0.668691  0.591764  0.783917  0.929242
357  0.101081  0.762781  0.018941  0.783064  0.960120
358  0.351277  0.637650  0.353735  0.204867  0.909795
365  0.575035  0.137423  0.873037  0.112542  0.947581
387   0.49688  0.648120  0.312400  0.196764  0.985770
390  0.833417  0.883816  0.179864  0.499876  0.962754
393  0.135218  0.417083  0.513681  0.869322  0.933552
409  0.817462  0.336233  0.876046  0.966647  0.932644
411  0.967861  0.548224  0.978607  0.046937  0.965125
420   0.10595  0.189691  0.393835  0.964355  0.986559
421  0.084809  0.515765  0.679270  0.575461  0.995081
424  0.366771  0.747376  0.898724  0.711992  0.947756
432  0.723629  0.693707  0.466601  0.332991  0.966966
442  0.534451  0.404527  0.873619  0.575251  0.915457

In [48]:
new_df.loc[:]

            A         B         C         D         E
0         0.5  0.389168  0.052477  0.423259  0.407235
1    0.060224  0.987430  0.005725  0.153605  0.256132
2     0.72861  0.238399  0.018725  0.408156  0.815878
3    0.917867  0.467754  0.046411  0.870903  0.554316
4    0.674388  0.011974  0.557985  0.551180  0.759762
..        ...       ...       ...       ...       ...
440  0.366501  0.338691  0.065218  0.622642  0.255830
441  0.612678  0.704572  0.355077  0.002490  0.082120
442  0.534451  0.404527  0.873619  0.575251  0.915457
443   0.20947  0.406620  0.171258  0.115146  0.074322
444  0.319014  0.319168  0.302161  0.534227  0.648596

[445 rows x 5 columns]

In [49]:
new_df.loc[10, "A"] = 108
new_df.dtypes

A     object
B    float64
C    float64
D    float64
E    float64
dtype: object

In [50]:
new_df.head(3)

          A         B         C         D         E
0       0.5  0.389168  0.052477  0.423259  0.407235
1  0.060224  0.987430  0.005725  0.153605  0.256132
2   0.72861  0.238399  0.018725  0.408156  0.815878

In [51]:
print(new_df.iloc[0, 2])   # work with just index no need of ccolumns and rows name
print(new_df.iloc[:, 2])

0.05247733093235396
0      0.052477
1      0.005725
2      0.018725
3      0.046411
4      0.557985
         ...
440    0.065218
441    0.355077
442    0.873619
443    0.171258
444    0.302161
Name: C, Length: 445, dtype: float64

In [52]:
new_df.iloc[[0, 3], [1, 4, 3]]

          B         E         D
0  0.389168  0.407235  0.423259
3  0.467754  0.554316  0.870903

In [53]:
new_df.iloc[0, 3] = 6
new_df.iloc[0, 3]

6.0

In [54]:
new_df.drop({"A", "C"}, axis=1)

            B         D         E
0    0.389168  6.000000  0.407235
1    0.987430  0.153605  0.256132
2    0.238399  0.408156  0.815878
3    0.467754  0.870903  0.554316
4    0.011974  0.551180  0.759762
..        ...       ...       ...
440  0.338691  0.622642  0.255830
441  0.704572  0.002490  0.082120
442  0.404527  0.575251  0.915457
443  0.406620  0.115146  0.074322
444  0.319168  0.534227  0.648596

[445 rows x 3 columns]

In [55]:
new_df.drop({4, 440, 444}, axis=0, inplace=True)

In [56]:
new_df

            A         B         C         D         E
0         0.5  0.389168  0.052477  6.000000  0.407235
1    0.060224  0.987430  0.005725  0.153605  0.256132
2     0.72861  0.238399  0.018725  0.408156  0.815878
3    0.917867  0.467754  0.046411  0.870903  0.554316
5    0.784892  0.760276  0.525272  0.418736  0.835230
..        ...       ...       ...       ...       ...
438  0.807617  0.081209  0.139690  0.825553  0.094354
439  0.985746  0.102980  0.671839  0.336475  0.362165
441  0.612678  0.704572  0.355077  0.002490  0.082120
442  0.534451  0.404527  0.873619  0.575251  0.915457
443   0.20947  0.406620  0.171258  0.115146  0.074322

[442 rows x 5 columns]

In [57]:
new_df.reset_index(drop=True, inplace=True)

In [58]:
new_df

            A         B         C         D         E
0         0.5  0.389168  0.052477  6.000000  0.407235
1    0.060224  0.987430  0.005725  0.153605  0.256132
2     0.72861  0.238399  0.018725  0.408156  0.815878
3    0.917867  0.467754  0.046411  0.870903  0.554316
4    0.784892  0.760276  0.525272  0.418736  0.835230
..        ...       ...       ...       ...       ...
437  0.807617  0.081209  0.139690  0.825553  0.094354
438  0.985746  0.102980  0.671839  0.336475  0.362165
439  0.612678  0.704572  0.355077  0.002490  0.082120
440  0.534451  0.404527  0.873619  0.575251  0.915457
441   0.20947  0.406620  0.171258  0.115146  0.074322

[442 rows x 5 columns]

In [59]:
new_data = {
    'A' : [None, None, 4, 6, 7, 9],
    'B' : [0, 3, 5, 7, None, 8],
    'C' : [5, None, 4, 56, 6, 90],
    'D' : [239, 234, None, 0, 0, 23]
    
}
new_data = pd.DataFrame(new_data)

In [60]:
new_data

     A    B     C      D
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [61]:
new_data.dropna()

     A    B     C     D
3  6.0  7.0  56.0   0.0
5  9.0  8.0  90.0  23.0

In [62]:
new_data.columns = ["K", "L", "M", "N"]

In [63]:
new_data

     K    L     M      N
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [64]:
new_data.rename(index={_:__ for _, __ in enumerate("GAUTAM")})

     K    L     M      N
G  NaN  0.0   5.0  239.0
A  NaN  3.0   NaN  234.0
U  4.0  5.0   4.0    NaN
T  6.0  7.0  56.0    0.0
A  7.0  NaN   6.0    0.0
M  9.0  8.0  90.0   23.0

In [65]:
new_data.drop_duplicates(subset=new_data.columns)

     K    L     M      N
0  NaN  0.0   5.0  239.0
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0
5  9.0  8.0  90.0   23.0

In [66]:
new_data.isnull()
new_data["K"].isnull()

0     True
1     True
2    False
3    False
4    False
5    False
Name: K, dtype: bool

In [67]:
new_data.drop([0, 5], axis=0)

     K    L     M      N
1  NaN  3.0   NaN  234.0
2  4.0  5.0   4.0    NaN
3  6.0  7.0  56.0    0.0
4  7.0  NaN   6.0    0.0

In [68]:
new_df["B"] = 0
new_df["B"] == 0

0      True
1      True
2      True
3      True
4      True
       ...
437    True
438    True
439    True
440    True
441    True
Name: B, Length: 442, dtype: bool

In [69]:
new_df.loc[:, ["B"]] = None
new_df.loc[:, ["B"]].isnull().head()

      B
0  True
1  True
2  True
3  True
4  True

In [70]:
new_df.loc[:, ["C"]].describe()

                C
count  442.000000
mean     0.489151
std      0.299504
min      0.001943
25%      0.224216
50%      0.486578
75%      0.751956
max      0.999605

In [71]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [72]:
df.dropna()
df.dropna(how="any", axis=1)

     name
0  Alfred
1  Batman
2  Alfred

In [73]:
df.drop_duplicates(subset=["name"], keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [74]:
df.shape
new_data.shape
new_df.shape

(442, 5)

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [76]:
df.loc[:, ["name"]].value_counts()

name
Alfred    2
Batman    1
dtype: int64

In [77]:
df.loc[[0, 1], ["name", "toy"]].value_counts(dropna=False)

name    toy
Alfred  NaN          1
Batman  Batmobile    1
dtype: int64

In [78]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [79]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

# I/O in Exel Sheets with Pandas

In [80]:
contacts = pd.read_excel("contacts.xlsx", sheet_name="contacts")

ValueError: Worksheet named 'contact1' not found

In [ ]:
contacts.fillna(value={"E-mail address" : "Not in Server", "Phone Number" : "Out of Contacts"}, inplace = True)

In [ ]:
contacts.iloc[:, [2]] == "Out of Contacts"

In [ ]:
contacts.iloc[0, 2] = 234235423
contacts

In [ ]:
contacts2 = pd.read_excel("contacts.xlsx", sheet_name="contacts2")

In [ ]:
new_data = {"Name" : "Abhinav Choudhary", "E-mail address" : "abhinavchaudhary351@gmail.com", "Phone Number" : "+91 8092347234"}
contacts2 = contacts2.append(new_data, ignore_index=True)

In [ ]:
contacts2

In [ ]:
# contacts2.to_excel("contacts.xlsx", sheet_name='contacts2')

In [ ]:
with pd.ExcelWriter('contacts.xlsx') as writer:  
    contacts.to_excel(writer, sheet_name='contact1')
    contacts2.to_excel(writer, sheet_name='contact2')

In [ ]:
# samjh rahe ho